[
    {
        "name": "dia0",
        "map": "random",
        "x": 18,
        "sentences": [
            {
                "text": "Bonjour mon chéri, je voulais te parler... Le monde est vaste et rempli de mystères. Ta sœur est partie pour l'aventure il y a plusieurs mois, mais nous n'avons plus de nouvelles d'elle depuis. Je sais que cela t'inquiète, mais je suis sûre qu'elle est en sécurité. Cependant, je pense qu'il est temps pour toi de partir à sa recherche. Tu es prêt, n'est-ce pas ? Avant que tu partes, tu devrais aller voir le Professeur Chêne. Il pourra t'aider à te préparer pour ton voyage. Prends soin de toi, mon chéri.",
                "imageName": "mom.png"
            },
            {
                "text": "Ah, te voilà ! Ta mère m'a parlé de ta décision. C'est une grande responsabilité que tu assumes, mais je suis sûr que tu es prêt.Avant que tu ne partes, je veux te donner un Pokémon. Ce sera ton premier compagnon d'aventure. Choisis bien, car il sera à tes côtés tout au long de ton voyage. Ces trois Pokémon sont tous spéciaux à leur manière. Prends ton temps pour faire ton choix. Je suis là pour répondre à tes questions. Une fois que tu auras choisi, ton aventure commencera officiellement. N'oublie pas, c'est dangereux de partir seul. Bonne chance, jeune dresseur !",
                "imageName": "prof.png"
            }
        ]
    },
    {
        "name": "dia1",
        "map": "start",
        "x": 18,
        "sentences": [
            {
                "text": "Eh, attends une seconde ! Tu veux vraiment quitter le village maintenant ? Je dois te prévenir, au bout de cette route, juste avant d'arriver à la première ville, il y a Garry... C'est un grand gaillard, super fort ! Il attend toujours ici, prêt à lancer un duel contre quiconque essaie de passer. Il ne m'a pas laissé passer... Je suis coincé ici à cause de lui.Mais avant que tu t'aventures là-bas, je veux voir de quoi tu es capable ! Si tu ne peux même pas me battre, tu n'as aucune chance contre Garry. Allez, montre-moi ce que tu sais faire ! Prépare-toi à te battre !",
                "imageName": "a.png"
            }
        ],
        "end": "battle",
        "team": "timmy"
    }
]